{
  "panels": {
    "left": {
      "text": "Blockchain",
      "url": "#moi",
      "images": {
        "horizontal": [
          "ui1",
          "ui2",
          "ui3"
        ],
        "vertical": [
          "SMXS-ui"
        ]
      }
    },
    "right": { 
      "text": "Artificial Intelligence",
      "url": "#disable",
      "images": {
        "horizontal": [
          "visdev1",
          "visdev2",
          "visdev3"
        ],
        "vertical": [
          "SMXS-visdev"
        ]
      }
    }
  },
  "info": {
    "introduction": "My name is James Lawton. I'm passionate about neuroscience, blockchain, robotics, and AI. I currently work at Max Planck as a blockchain & AI developer.",
    "social": ["#github", "#linkedin"],
    "email": "jameslawtontum@gmail.com",
    "portals": {
      "Blog": {
        "title": "Blog",
        "description": "An overview of my written blog posts. I write about a multitude of topics, but tend to focus on my mentioned research fields. Specifically, artificial-affect, task generalization, robotics, blockchain, modifications to the current scientific publishing model, amongst others.",
        "imagename": "blog.jpeg",
        "url": "https://medium.com/@james_lawton"
      },
      "Web Development": {
        "title": "Web Development",
        "description": "I also build and manage websites and web applications for various clients. This includes decentralized applications, embedded neural networks, or performant and responsive websites for your business.",
        "imagename": "info-visdev",
        "url": "#url"
      }
    },
    "links":{
      "introduction": "Here's a selection of projects I am currently working on or have in the past.",
      "elements": [
        {
          "title": "Bloxberg",
          "description": "Bloxberg is a scientific-focused blockchain consortium between various research institutions. These institutes run a node on a fork of Ethereum utilizing Proof of Authority consensus with the goal of providing scientific focused applications for researchers to enhance their work.",
          "imagename": "blockchainui4.png",
          "url": "https://bloxberg.org"
        },
        {
          "title": "Write like your favorite author",
          "description": "Two concurrent word-level recurrent neural networks. This project extracts semantic and syntactic information from a database of any author with a sufficient body of work and provides the user input into sentence construction. It currently utilizes the Harry Potter novels, so you can write your own Harry Potter book!",
          "imagename": "info-ui",
          "url": "#url"
        },
        {
          "title": "Meta Reinforcement Learning",
          "description": "This project is an implementation of Meta RL, which essentially is a network that learns how to learn. The primary benefit is task generalization in that a single trained network can achieve high accuracy on multiple tasks in the same domain. This implementation is tested with three different bandits with varying degrees of difficulty.",
          "imagename": "info-visdev",
          "url": "#url"
        }
      ]
    } 
      
  }
}